PARENT
?- parent(tom_louis,Child).
Child = mary_louis ;
Child = jane_louis ;
Child = katie_louis .

?- parent(Parent,Child).
Parent = tom_smith,
Child = mark_smith ;
Parent = tom_smith,
Child = freddy_smith ;
Parent = tom_smith,
Child = joe_smith .

MARRIED

?- married(Husband,Wife).
Husband = tom_smith,
Wife = evelyn_harris ;
Husband = mark_smith,
Wife = pam_wilson .


ANCESTOR

?- ancestor(julia_swift,kenneth_harris).
true .

?- ancestor(Ancestor,Person).
Ancestor = tom_smith,
Person = mark_smith ;
Ancestor = tom_smith,
Person = freddy_smith ;
Ancestor = tom_smith,
Person = joe_smith ;
Ancestor = tom_smith,
Person = francis_smith .

DESCENDENT 

?- descendent(kenneth_harris,julia_swift).
true .

?- descendent(Descendent,Person).
Descendent = mark_smith,
Person = tom_smith ;
Descendent = freddy_smith,
Person = tom_smith ;
Descendent = joe_smith,
Person = tom_smith .

GENERATIONS
?- generations(susan_holt,katie_louis,Generations).
Generations = 3 .
?- generations(Ancestor,Person,Generations).
Ancestor = tom_smith,
Person = mark_smith,
Generations = 1 ;
Ancestor = tom_smith,
Person = freddy_smith,
Generations = 1 ;
Ancestor = tom_smith,
Person = joe_smith,
Generations = 1 ;
Ancestor = tom_smith,
Person = francis_smith,
Generations = 1 ;
Ancestor = mark_smith,
Person = martha_smith,
Generations = 1 ;
Ancestor = mark_smith,
Person = frederick_smith,
Generations = 1 ;
Ancestor = freddy_smith,
Person = jill_smith,
Generations = 1 ;
Ancestor = freddy_smith,
Person = marcus_smith,
Generations = 1 ;
Ancestor = freddy_smith,
Person = tim_smith,
Generations = 1 ;
Ancestor = john_smith,
Person = julie_smith,
Generations = 1 ;
Ancestor = john_smith,
Person = leslie_smith,
Generations = 1 .

LEAST_COMMON_ANCESTOR
?- least_common_ancestor(Person1,Person2,margaret_little).
Person1 = june_harris,
Person2 = jackie_harris ;
Person1 = june_harris,
Person2 = leonard_harris ;
Person1 = june_harris,
Person2 = jennifer_harris ;
Person1 = june_harris,
Person2 = karen_harris ;
Person1 = june_harris,
Person2 = kenneth_harris ;
Person1 = jackie_harris,
Person2 = june_harris ;
Person1 = jackie_harris,
Person2 = leonard_harris ;
Person1 = jackie_harris,
Person2 = jennifer_harris ;
Person1 = jackie_harris,
Person2 = karen_harris ;
Person1 = jackie_harris,
Person2 = kenneth_harris ;
Person1 = leonard_harris,
Person2 = june_harris ;
Person1 = leonard_harris,
Person2 = jackie_harris ;
Person1 = leonard_harris,
Person2 = jennifer_harris ;
Person1 = leonard_harris,
Person2 = karen_harris ;
Person1 = leonard_harris,
Person2 = kenneth_harris ;
Person1 = jennifer_harris,
Person2 = june_harris ;
Person1 = jennifer_harris,
Person2 = jackie_harris ;
Person1 = jennifer_harris,
Person2 = leonard_harris ;
Person1 = karen_harris,
Person2 = june_harris ;
Person1 = karen_harris,
Person2 = jackie_harris ;
Person1 = karen_harris,
Person2 = leonard_harris ;
Person1 = kenneth_harris,
Person2 = june_harris ;
Person1 = kenneth_harris,
Person2 = jackie_harris ;
Person1 = kenneth_harris,
Person2 = leonard_harris ;
false.
?- least_common_ancestor(karen_harris,martha_smith,Ancestor).
Ancestor = robert_harris ;
Ancestor = julia_swift ;
false.
?- least_common_ancestor(karen_harris,kenneth_harris,Parent).
Parent = leonard_harris ;
Parent = constance_may ;
false.
?- least_common_ancestor(Person1,Person2,Ancestor).
Person1 = mark_smith,
Person2 = freddy_smith,
Ancestor = tom_smith ;
Person1 = mark_smith,
Person2 = joe_smith,
Ancestor = tom_smith ;
Person1 = mark_smith,
Person2 = francis_smith,
Ancestor = tom_smith ';
Person1 = mark_smith,
Person2 = martha_smith,
Ancestor = tom_smith .
?- least_common_ancestor(jill_smith,julie_smith,Ancestor).
false.

BLOOD
?- blood(jill_smith,julie_smith).
false.
?- blood(heather_smith,julie_smith).
true .
?- blood(Person1,Person2).
Person1 = mark_smith,
Person2 = freddy_smith ;
Person1 = mark_smith,
Person2 = joe_smith ;
Person1 = mark_smith,
Person2 = francis_smith ;
Person1 = mark_smith,
Person2 = martha_smith .

SIBLING
?- sibling(heather_smith,julie_smith).
true .
?- sibling(Person1,Person2).
Person1 = mark_smith,
Person2 = freddy_smith ;
Person1 = mark_smith,
Person2 = joe_smith ;
Person1 = mark_smith,
Person2 = francis_smith ;
Person1 = freddy_smith,
Person2 = mark_smith ;
Person1 = freddy_smith,
Person2 = joe_smith ;
Person1 = freddy_smith,
Person2 = francis_smith ;
Person1 = joe_smith,
Person2 = mark_smith ;
Person1 = joe_smith,
Person2 = freddy_smith .

FATHER
?- father(tom_smith,joe_smith).
true .
?- father(Parent,Child).
Parent = tom_smith,
Child = mark_smith ;
Parent = tom_smith,
Child = freddy_smith ;
Parent = tom_smith,
Child = joe_smith ;
Parent = tom_smith,
Child = francis_smith ;
Parent = mark_smith,
Child = martha_smith .

MOTHER
?- mother(Parent,Child).
Parent = evelyn_harris,
Child = mark_smith ;
Parent = evelyn_harris,
Child = freddy_smith ;
Parent = evelyn_harris,
Child = joe_smith ;
Parent = evelyn_harris,
Child = francis_smith ;
Parent = pam_wilson,
Child = martha_smith .

UNCLE
?- uncle(tom_smith,june_harris).
true .
?- uncle(Uncle,Person).
Uncle = freddy_smith,
Person = martha_smith ;
Uncle = freddy_smith,
Person = frederick_smith ;
Uncle = mark_smith,
Person = jill_smith ;
Uncle = mark_smith,
Person = marcus_smith ;
Uncle = mark_smith,
Person = tim_smith ;
Uncle = tom_louis,
Person = lilly_thompson .
?- uncle(joe_smith,martha_smith).
true .

AUNT
?- aunt(francis_smith,Person).
Person = martha_smith ;
Person = frederick_smith ;
Person = jill_smith ;
Person = marcus_smith ;
Person = tim_smith ;
false.
?- aunt(connie_warrick,Person).
Person = martha_smith ;
Person = frederick_smith ;
false.
?- aunt(Aunt,Person).
Aunt = connie_warrick,
Person = martha_smith ;
Aunt = connie_warrick,
Person = frederick_smith ;
Aunt = pam_wilson,
Person = jill_smith ;
Aunt = pam_wilson,
Person = marcus_smith ;
Aunt = pam_wilson,
Person = tim_smith ;
Aunt = catherine_thompson,
Person = lilly_thompson ;
Aunt = mary_snyder,
Person = lilly_thompson .

COUSIN 
?- cousin(jane_louis, Cousin).
Cousin = lilly_thompson ;
Cousin = richard_thompson ;
Cousin = marcus_thompson ;
false.
?- cousin(Cousin,jane_louis).
Cousin = lilly_thompson ;
Cousin = richard_thompson ;
Cousin = marcus_thompson ;
false.
?- cousin(Cousin,Person).
Cousin = martha_smith,
Person = jill_smith ;
Cousin = martha_smith,
Person = marcus_smith ;
Cousin = martha_smith,
Person = tim_smith ;
Cousin = martha_smith,
Person = june_harris ;
Cousin = martha_smith,
Person = jackie_harris ;
Cousin = martha_smith,
Person = leonard_harris ;
Cousin = martha_smith,
Person = jennifer_harris ;
Cousin = martha_smith,
Person = karen_harris ;
Cousin = martha_smith,
Person = kenneth_harris ;
Cousin = frederick_smith,
Person = jill_smith ;
Cousin = frederick_smith,
Person = marcus_smith .
?- cousin(martha_smith, Cousin).
Cousin = jill_smith ;
Cousin = marcus_smith ;
Cousin = tim_smith ;
Cousin = june_harris ;
Cousin = jackie_harris ;
Cousin = leonard_harris ;
Cousin = jennifer_harris ;
Cousin = karen_harris ;
Cousin = kenneth_harris ;
false.

COUSIN_TYPE 
?- cousin_type(martha_smith, Cousin, CousinType, Removed).
Cousin = jill_smith,
CousinType = 1,
Removed = 0 ;
Cousin = marcus_smith,
CousinType = 1,
Removed = 0 ;
Cousin = tim_smith,
CousinType = 1,
Removed = 0 ;
Cousin = june_harris,
CousinType = Removed, Removed = 1 ;
Cousin = jackie_harris,
CousinType = Removed, Removed = 1 ;
Cousin = leonard_harris,
CousinType = Removed, Removed = 1 ;
Cousin = jennifer_harris,
CousinType = 2,
Removed = 0 ;
Cousin = karen_harris,
CousinType = 2,
Removed = 0 ;
Cousin = kenneth_harris,
CousinType = 2,
Removed = 0 ;
false
?- cousin_type(Person1,Person2,2,0).
Person1 = martha_smith,
Person2 = jennifer_harris ;
Person1 = martha_smith,
Person2 = karen_harris ;
Person1 = martha_smith,
Person2 = kenneth_harris ;
Person1 = frederick_smith,
Person2 = jennifer_harris ;
Person1 = frederick_smith,
Person2 = karen_harris ;
Person1 = frederick_smith,
Person2 = kenneth_harris ;
Person1 = jill_smith,
Person2 = jennifer_harris ;
Person1 = jill_smith,
Person2 = karen_harris ;
Person1 = jill_smith,
Person2 = kenneth_harris ;
Person1 = marcus_smith,
Person2 = jennifer_harris ;
Person1 = marcus_smith,
Person2 = karen_harris ;
Person1 = marcus_smith,
Person2 = kenneth_harris ;
Person1 = tim_smith,
Person2 = jennifer_harris ;
Person1 = tim_smith,
Person2 = karen_harris ;
Person1 = tim_smith,
Person2 = kenneth_harris ;
Person1 = jennifer_harris,
Person2 = martha_smith ;
Person1 = jennifer_harris,
Person2 = frederick_smith ;
Person1 = jennifer_harris,
Person2 = jill_smith ;
Person1 = jennifer_harris,
Person2 = marcus_smith ;
Person1 = jennifer_harris,
Person2 = tim_smith ;
Person1 = karen_harris,
Person2 = martha_smith ;
Person1 = karen_harris,
Person2 = frederick_smith ;
Person1 = karen_harris,
Person2 = jill_smith ;
Person1 = karen_harris,
Person2 = marcus_smith ;
Person1 = karen_harris,
Person2 = tim_smith ;
Person1 = kenneth_harris,
Person2 = martha_smith ;
Person1 = kenneth_harris,
Person2 = frederick_smith ;
Person1 = kenneth_harris,
Person2 = jill_smith ;
Person1 = kenneth_harris,
Person2 = marcus_smith ;
Person1 = kenneth_harris,
Person2 = tim_smith ;
;false.
?- cousin_type(kenneth_harris,jill_smith,2,0).
true .
?- cousin_type(kenneth_harris,jill_smith,1,0).
false.